In [1]:
import pandas as pd
import glob


csv_files = glob.glob("/Users/Goldie/Desktop/Ironhack/Project/IronHack-w3-Modual1-Project3/Data/Clean/*.csv")

In [2]:
country_area_df = pd.read_csv("/Users/Goldie/Desktop/Ironhack/Project/IronHack-w3-Modual1-Project3/Data/Clean/country_area_mapping.csv")

In [3]:
country_area_df["area"].value_counts()

area
Europe           54
Africa           53
Asia             38
North America    29
South America    12
Oceania           5
Name: count, dtype: int64

In [ ]:
all_nationalities = []

for file in csv_files:
    df = pd.read_csv(file)
    all_nationalities.append(df["Nationality"])


all_nationalities_df = pd.DataFrame(
    pd.concat(all_nationalities).unique(),
    columns=["Nationality"]
    )

In [14]:

all_nationalities_df

             Nationality
0                Uruguay
1                Belgium
2                  Italy
3                Austria
4                 France
..                   ...
186                Aruba
187          South Korea
188  São Tomé e Príncipe
189                  USA
190                Yemen

[191 rows x 1 columns]

In [ ]:
final_country_area_df = all_nationalities_df.merge(
country_area_df,
on="Nationality",
how="left"
)

In [15]:

final_country_area_df.loc[final_country_area_df["area"] == "Other", "Nationality"].unique()

<StringArray>
[]
Length: 0, dtype: str

In [ ]:
pd.reset_option("display.max_rows")
final_country_area_df.sort_values("Nationality")

     Nationality    area
151  Afghanistan    Asia
80       Albania  Europe
41       Algeria  Africa
160      Andorra  Europe
90        Angola  Africa
..           ...     ...
176      Vietnam    Asia
5          Wales  Europe
190        Yemen    Asia
125       Zambia  Africa
93      Zimbabwe  Africa

[191 rows x 2 columns]

In [ ]:
all_countries = set(country_area_df["Nationality"])

In [12]:

all_nationalities_in_csvs = set()


for file in csv_files:
    updated_df = pd.read_csv(file)
    all_nationalities_in_csvs.update(df["Nationality"].unique())

missing_countries = all_nationalities_in_csvs - all_countries

In [13]:
print("Countries missing from country_area_df:", missing_countries)

Countries missing from country_area_df: set()